import React from "react";

export const BigCard = () => {
  return (
    <div className="relative flex flex-col items-center justify-center">
      <div className="pt-[120px] shadow-xl w-[1440px] h-[646px] rounded-[25px] bg-white flex flex-col items-center px-[44px] py-[44px] gap-[20px]">
        <div className="text-[47.04px] w-[677px] tracking-[-1.3px] text-center">
          <p className="text-[#1D1D1D] leading-[115%]">
            Сервис, который
            <span className="text-[#4A96FF] font-bold leading-[115%]">
              {" "}
              заменит
            </span>{" "}
            <span className="text-[#000000] font-bold leading-[115%]">
              целого менеджера-аналитика
            </span>
          </p>
        </div>
        <div className="flex flex-col gap-[19.5px]">
          <p className="text-black opacity-50 text-[20px] leading-[135%] tracking-[-0.3px] text-center">
            Для селлеров — новый сотрудник, для менеджеров — личный помощник!{" "}
            <br />
            AI-аналитик MPpulse экономит до 6 часов в день вашего времени
          </p>
        </div>
        <div className="flex items-center mt-[16px]">
          <div className="relative flex flex-col gap-[10px] bg-[#4C3AFF] p-[26px] rounded-[20px] w-[241px] text-white">
            <div className="flex items-center gap-[15px] pl-2">
              <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="#4C42FF"
                />
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="white"
                />
              </svg>

              <p className="text-[32.83px] font-bold leading-[115%]">-1 час</p>
            </div>
            <hr />
            <div>
              <p className="text-[17px] font-semibold leading-[115%] tracking-[-0.3px]">
                на оцифровке, отчётах и ведении РНП
              </p>
            </div>
            <div className="rounded-[100px] h-[62px] w-[4px] bg-[#d2dbff] absolute top-1/2 -translate-y-1/2 -left-[2px]"></div>
            <div className="z-10 rounded-[100px] h-[62px] w-[4px] bg-[#d2dbff] absolute top-1/2 -translate-y-1/2 -right-[2px]"></div>
          </div>
          <div className="relative flex flex-col gap-[10px] bg-[#49BCFF] p-[26px] rounded-[20px] w-[360px] text-white">
            <div className="flex items-center gap-[15px] pl-2">
              <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="#49BCFF"
                />
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="white"
                />
              </svg>

              <p className="text-[32.83px] font-bold leading-[115%]">-2 часа</p>
            </div>
            <hr />
            <div>
              <p className="text-[17px] font-semibold leading-[115%] tracking-[-0.3px]">
                на анализе всех показателей карточек товаров и анализ
                конкурентов
              </p>
            </div>
            <div className="z-10 rounded-[100px] h-[62px] w-[4px] bg-[#d2dbff] absolute top-1/2 -translate-y-1/2 -right-[2px]"></div>
          </div>
          <div className="relative flex flex-col gap-[10px] bg-[#4C3AFF] p-[26px] rounded-[20px] w-[241px] text-white">
            <div className="flex items-center gap-[15px] pl-2">
              <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="#4C42FF"
                />
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="white"
                />
              </svg>

              <p className="text-[32.83px] font-bold leading-[115%]">-1 час</p>
            </div>
            <hr />
            <div>
              <p className="text-[17px] font-semibold leading-[115%] tracking-[-0.3px]">
                на выявление причин падения показателей
              </p>
            </div>
            <div className="z-10 rounded-[100px] h-[62px] w-[4px] bg-[#d2dbff] absolute top-1/2 -translate-y-1/2 -right-[2px]"></div>
          </div>
          <div className="relative flex flex-col gap-[10px] bg-[#49BCFF] p-[26px] rounded-[20px] w-[360px] text-white">
            <div className="flex items-center gap-[15px] pl-2">
              <svg
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="#49BCFF"
                />
                <path
                  d="M15.9996 0C7.17758 0 0 7.17721 0 15.9996C0 24.8221 7.17721 31.9996 15.9996 31.9996C24.8224 31.9996 32 24.8224 32 15.9996C32 7.17758 24.8224 0 15.9996 0ZM15.9996 29.7703C8.40666 29.7703 2.22929 23.593 2.22929 15.9996C2.22929 8.56234 8.15698 2.48752 15.5352 2.24118V15.9996C15.5352 16.2096 15.676 16.3938 15.8789 16.4481C15.919 16.4589 15.9595 16.4641 15.9996 16.4641C16.1624 16.4641 16.3169 16.3786 16.4016 16.2326L23.3009 4.33226C27.1829 6.77036 29.7707 11.0874 29.7707 15.9996C29.7707 23.593 23.593 29.7703 15.9996 29.7703Z"
                  fill="white"
                />
              </svg>

              <p className="text-[32.83px] font-bold leading-[115%]">-2 часа</p>
            </div>
            <hr />
            <div>
              <p className="text-[17px] font-semibold leading-[115%] tracking-[-0.3px]">
                на анализе всех ключей в рекламе и выборе стратегии по ним
              </p>
            </div>
            <div className="z-10 rounded-[100px] h-[62px] w-[4px] bg-[#d2dbff] absolute top-1/2 -translate-y-1/2 -right-[2px]"></div>
          </div>
        </div>
      </div>
      <div className="shadow-xl -z-10 absolute top-0 right-1/2 translate-x-1/2 w-[1326px] h-[calc(100%+25px)] rounded-[25px] bg-white opacity-50"></div>
    </div>
  );
};
